var t = getApp();

Page({
  data: {
    message:[],
    result: [
      {
        id: 0, img: "/images/1.png", title: "新手攻略", text: "捕鱼达人新手怎么玩？捕鱼达人玩法非常简单，但是很考验玩家对于捕鱼达人的熟悉度，想要打到鱼不是随随便便开炮就行的，玩家需要挑选角度，以及看准时机，下面小编为大家整理了一下捕鱼达人新手上手攻略，一起来看看吧。1、在我们打鱼时，通常会发现在炮塔周围有一些游动非常缓慢的鱼，灯笼，魔鬼，乌龟都有，那些基本上全部是给你送分的，只要调准角度和等级连续打，基本可以拿下。2、在把炮塔调到基本45度角度时候，通常可以看到一些向你的炮塔直冲而下的鱼，这些鱼的速度很快，遇到这种鱼，我通常采取迎射，往往是2级和三级炮弹的连发，打鱼的两侧，而且要左右切换的攻击，特别是打魔鬼鱼的时候，记住!炮弹一定要先打鱼的外侧翅膀，然后切换到左侧，连击，命中率很高。3、从炮塔左侧出来的灯笼鱼，绕着你的炮塔很近游动的那些乌龟，尽量就不要浪费炮弹了，命中率很低，从炮塔左侧突然出现的鲨鱼，如果你平常喜欢用三级打，如果看到这样的鲨鱼，先用三级打一发，然后突然提高一级，连发两发，炮塔的位置一定要在45度角上，追射鲨鱼的前后鱼鳍，如果2发炮弹还搞不定，就不要浪费炮弹了。4、在打离炮塔很近的乌龟的时候，先用平常打的炮弹打一发，然后突然升级，再打一发，打乌龟颈部，四肢和尾巴，命中率会高很多。"
      },
      {
        id: 1, img: "/images/2.png", title: "史上最全鱼种捕鱼技巧分享", text: "小丑鱼：一般用5号，在小丑鱼钻去炮台底下的时候打，打不中的话也能粘中别的鱼。鳊鱼：用4号炮或5号炮，有一个专门的场景里都是鳊鱼和小黄鱼，很有必要用4号炮来打一打，有时候有很高的爆率。抓到了，分数也挺多的。红杉鱼：速度比起鳊鱼来会比较慢，游到离炮台近的地方能够去打一打，但一定要粘一下别的鱼。安康鱼：如果用1到3号炮的话，就要对准鱼鳃的位置打。4~5号炮就瞄准两条安康鱼的中间位置打。这里有一点需要注意，安康鱼若是和刺豚、神仙鱼重合出现的话，要等他们重合了之后再打。神仙鱼：用3号炮和5号炮。分比较少的时候，用3号炮连续打4分鱼，也不失为积攒分数的好办法，用5号炮来粘别的鱼打。小光鱼：都是6只一组，打它一般都用3号炮和5号炮，最容易击中，但两者又有区别。3号炮普遍是被用来抓一群群的小光鱼的，5号炮用来在小光鱼和灯笼乌龟重合时发射，常常能打中大鱼，即便是没中也不亏分。小黄鱼：一般都是用2号炮和4号炮去打，与小光鱼相同，一般不单打，在和大鱼聚集起来的时候再打。蓝鲨：鲨鱼主要是杀分的，重点不是要如何打下来，而是要怎么抑制住冲动，不因鲨鱼损失很多分。通常是用6号炮打3~5发，比较旺的时候可以用7号炮轰，但是一般都是5发以内。刺尾鱼：建议大家用4号炮和5号炮来打，当都是刺尾鱼与小黄鱼时，强烈推荐用4号打打看，很多时候击中的几率还是挺高的。BOSS鱼：BOSS鱼是一种蓝色的鱼，很漂亮，而且打BOSS鱼还能获得很多的金币，但它出现只有几秒钟。当房间达到某种条件的时候，BOSS就会出现了，它会携带大量的金币出现，你的渔网只要是不落空，都会得到一定数量的金币奖励。另外在游戏页面的中间会有显示BOSS血量的，血量是0的时候就会掉下很多的宝石，当然务必要在BOSS鱼逃掉以前就捉到它才能得到。"
      },
      {
        id: 2, commend: "1", img: "/images/3.png", title: "蝙蝠鱼怎么打？", text:"捕鱼达人中有很多高分鱼，比如蝙蝠鱼，那蝙蝠鱼要怎么打?捕鱼达人3蝙蝠鱼高分捕鱼技巧在哪里?在这里!往下看，小编教你轻轻松松捕获高分蝙蝠鱼。捕捉时机,观察它的两个翅膀，当鱼翅向上，露出下面的白色腹部时，放炮捕捉。瞄准位置,横向游过时，打它的尾巴，成功率最高。或者蝙蝠鱼从炮塔下方游出，可以选择攻击它的腹部。注意事项：1.当蝙蝠鱼在屏幕中间偏右时，最容易捕捉。2.不要攻击背对着你看不见腹部的鱼。3.位置时机对，一般可以一击必杀。如果打了2~3炮都没有成功，那就不要再浪费子弹了。4此规律只适用于普通渔场，不包括特殊鱼潮。"
      },
      {
        id: 3, good: "1", img: "/images/4.png", title: "成就系统最全介绍", text: "捕鱼达人3增加了不少新鲜元素，成就系统也是一个有意思的玩法。那捕鱼达人3成就系统怎么玩?如何解锁成就系统?成就系统有哪些奖励?下面小编带来捕鱼达人3成就系统玩法攻略，教你如何解锁，如何得奖。一、成就分类：成就分为5类：鱼、炮、财富、手柄、奖章总共54个成就二、成就的解锁成就会在8级解锁，8级前不记录数据8级前点击，弹出文字框提示三、成就获得及奖励成就初始为0星，后面1,2,3星分别对应了不同数量的要求，达到后依次点亮每完成1星，获得这一星级对应的奖励，奖励均为水晶每个成就会有进度条来提示玩家当前的完成情况(进度条为0/1代表此成就是非积累的)成就达到3星后，此成就的面板会闪光"
      },
      {
        id: 4, img: "/images/5.png", title: "修改存档方法?", text: "存档内容：1.初始存档2.无限水晶无限金币ios捕鱼达人3存档：存档使用方法如果是喵助手打包好的存档可以直接链接设备后点击安装，触屏版直接安装。如果下载存档后是压缩包可以用以下方法：1、使用iTools等软件找到游戏2、点击浏览，进入游戏目录(注意：请备份原版的存档或文件，以免解锁失败导致失去存档)3、解压存档后，把文件夹内的Documents、Library文件夹复制到游戏里，覆盖原文件，如图所示。4、关闭软件，打开游戏，完成修改!好了，就是这么简单，就能完成捕鱼达人3的修改存档问题，快去试试吧，去体验捕鱼的快乐吧!"
      },
      {
        id: 5, commend: "1", good: "1", img: "/images/2.png", title: "寻找灯笼鱼", text: "找出灯笼鱼之中的珍贵灯笼鱼(出场时闪亮的那只)，瞄准其射击，正确可以获得金币，错误游戏结束。"
      },
      {
        id: 6, img: "/images/1.png", title: "宝箱模式", text: "宝箱模式的玩法。宝箱模式怎么玩?看下面吧!打中4只目标鱼则可打开宝箱，如果在时间限内未累积到4只时，游戏结束。须知：1.四条鱼全部打中后，会打开宝箱获得一定金币。2.每只目标与旁边有许多小蓝鱼护身，注意避开。3.大概一共有5~6波鱼潮，还是比较充足的。所以我们不用在一只鱼上浪费太久，如果角度不适宜捕捉，果断放弃。"
      },


    ],

  },
  onLoad: function (o) {
    var n = this;
    var num = o.id;
    n.setData({
      message:this.data.result[num],
      type: o.type
    });
    wx.setNavigationBarTitle({
      title: o.title,
    })
  },
  toOther: function (t) {
    console.log(t.currentTarget), wx.navigateToMiniProgram({
      appId: t.currentTarget.src,
      envVersion: "release",
      success: function (t) { }
    });
  },
  copyWeixin: function (t) {
    wx.setClipboardData({
      data: this.data.topic.weixin,
      success: function (t) {
        wx.getClipboardData({
          success: function (t) {
            console.log(t.data), wx.showToast({
              title: "已复制成功"
            });
          }
        });
      }
    });
  },
  preview: function (t) {
    console.log(t.target.dataset.src);
    var o = t.target.dataset.src;
    wx.previewImage({
      urls: [o]
    });
  },
  onReady: function () { },
  onShow: function () { },
  onHide: function () { },
  onUnload: function () { },
  onPullDownRefresh: function () { },
  onReachBottom: function () { },
  onShareAppMessage: function () { }
});