var t = getApp();

Page({
  data: {
    message: [],
    result: [
      {
        id: 0, img: "/images/1.png", title: "麻将基本规则", text: " 　　一、搬庄和定庄" +

          　　"四人一桌打牌，首先要安排坐次，也就是说，四人各位居何方，决定坐次这一程序称为“搬庄” ，也称作“板位”、“定位”或“打座”，所谓定庄，就是指找出第一位做庄的人。定庄的方法也很多，通常多由坐东位的人掷骰一次，两骰点相加，按此数点逆时针，数到谁，谁即为庄家(也称庄主) 。此外，居家欢聚或旧友重逢，一块打牌之时，多让德高望重之长者或客人先作庄，以示敬重或谦让。" +

          "　　二、洗牌与彻牌" +

          "　　洗之前将牌正面扣下，四人同地将其搅开、和乱，使之充分混合，尽可能做到四家机会均等，也可防止作弊。洗好后，四人同时砌牌，方法是：把每两张置于一起叠成墩，并依次横排在门前成一条状; 家汇合围成方阵(又始传“方城，’) 。方阵之中，称“堂子”又称“海里”，或称“河里”。 砌牌数量.需依据打的是何种牌而定。如打”素麻将”各家均应砌17墩，打“四绘四听”麻将，各家则均应砌18墩等等，打牌过程中，各家所打出的牌，均应放于台中方，放后不允许后悔，更不允许打后取回。" +

          "　　三、做庄与掷骰" +

          "　　庄家“和”了牌，下盘仍继续做庄称“联庄”，也称“连庄”。庄家未能“和”牌，轮其下家做庄，这对庄来说叫“下庄”，对下家来说叫“上庄”，轮流做庄的顺序是：东风起，北风至，东、南、西、北依次轮流，四家各做一遍庄，称之谓“一圈”，四圈一局。按照规定，第一圈的圈风为东，第二圈为南，第三圈为西，第四圈为北。 下面我们再来介绍一下“开门”程序。如庄家掷骰为四.开门即在上家北门，此门接再掷一次，如果数点为七，两数之和则为11，即在北家的牌墙上(也“牌垄”上)从右到左数11墩留下，庄家从第12墩开始拿牌。此程序叫破墙开门或切牌。" +

          "　　四、拿牌及打牌" +

          "　　破墙开门之后，首先由庄家拿牌，又称“抓牌”或“起牌”，每次拿两墩，其它三家按逆时针方向依次轮流拿牌。但牌在墙上走向为顺时针。当各家均拿够六墩(12张)后，再由庄家“跳拿”两张，俗称“扫底”，其它各家再补拿]张。至此.庄家手牌14张，其它各家均为13张。这样拿上手的牌称作“配牌”，也乐“基牌”或“底牌”。拿牌结束后，接着庄家先打出第一张牌，此为打牌正式开始。" +

          "　　麻将怎么玩大家学会了，可以约上家人或者朋友来试一试，很快就会学会，而且很有意思，只是如果腰部不好或者颈椎不好的朋友不建议玩麻将，打麻将的时候需要一直坐着，时间长了对腰部和颈椎都是一种负荷，健康娱乐最重要。"
      },
      {
        id: 1, img: "/images/2.png", title: "怎么学会打麻将", text: " 　　一说到麻将可能很多人的印象并不好，麻将室赌博的一种，但并不表示它就是不好的，只要适量打麻将还是有许多的好处的。而且作为棋牌的一种，打麻将的广泛性还是非常强的，无论是老年人还是年轻人都会把它作为一个消遣活动，到底如何打麻将呢?打麻将又有哪些规则呢?下面就让我们一起来学一下吧!" +

          "　　打麻将作为一种大众娱乐活动其广泛性不言而喻。尽管不同的地方打麻将的方法有些不同，但他们最其本的规则却是差不多的。人们会在休息的时候约上好友或者与家人一起玩玩，既可以与家人朋友聊天，增进彼此感情，也会享受到它所带来的乐趣，那么到底该如何打麻将呢?" +

          "　　在娱乐时候，很多人就会想动动脑子，了解一下打麻将的技巧，让这个游戏更加的丰富一下，还能锻炼头脑的灵活度，其实打麻将是有很多的技巧的，只要平时稍加注意，总结经验就会掌握，但是不同的人会有很多不同的方式，所以打麻将的技巧要先掌握大的技巧方针，再因人而异就会有更大的胜算了。"
      },
      {
        id: 2, commend: "1", img: "/images/3.png", title: "打麻将的心态", text: " 1、每场必到，从不迟到早退。" +
          "\n" +
          　　"说明时间观念强。" + "\n" +

          "　　2、不抱怨、不嫌弃环境：小小几平方，抽烟的、有脚气的、都可接受。" + "\n" +

          "　　说明在通往成功的过程中，忍受一切恶劣环境因素。" + "\n" +

          "　　3、三缺一时心急如麻。" + "\n" +

          "　　说明有团队精神。" + "\n" +

          "　　4、一场输个几千元，脸不红心不跳，输赢一笑而过！今天输了，明日再捞回来！没钱还借高利贷！" + "\n" +

          "　　说明有投资观念。" + "\n" +

          "　　5、一张不中，摸下张！一把不胡，看下把！" + "\n" +

          "　　说明不怕失败，再接再励，活在希望当中。" + "\n" +

          "　　6、常常站在高手后面点头微笑，学习自己想要的东西。" + "\n" +

          "　　说明善于学习别人长处。" + "\n" +

          "　　7、简单的事情重复做，重复的动作快乐做，不吃饭，不回家，打到翻盘为止，甚至可以通宵达旦。" + "\n" +

          "　　说明有坚持到底，就是胜利的良好心态。" + "\n" +

          "　　8、经常被家人朋友反对不务正业，照样津津乐道！" + "\n" +

          "　　说明有为了目标，勇往直前，积极乐观的健康心态。" + "\n" +

          "　　9、碰牌，杠牌，都会感恩帮助你听牌的人。胡牌时，更会感谢放炮的人！" + "\n" +

          "　　说明有一颗懂的感恩的心！" + "\n" +

          "　　打麻将的各个心态，看你中招没。要是能把这打麻将的心态放到做事业上去，有什么事会做不成呢。当然了，也要提醒朋友们一句话：基础知识一定要打牢固。"
      },
      {
        id: 3, good: "1", img: "/images/4.png", title: "麻将打油诗", text: "平常日子压力多 待得闲来桌上搓" + "\n" +
          "输赢不论心平和 调好心态再忙活" + "\n" +
          "能围一张桌子坐 就成雀友好好摸" + "\n" +
          "牌运好比人生活 逆顺让人难捉摸" + "\n" +
          "万风条筒个个宝 好好待它有收获" + "\n" +
          "别看边张夹张多 琢磨牌面有门道" + "\n" +
          "孤张白板扔进锅 接着上手来一窝" + "\n" +
          "这牌让人怎么说 摒下心来再求索" + "\n" +
          "停牌停了边七条 一看是个许三多" + "\n" +
          "紧接七条炸一桌 亮剑亮了猛家伙" + "\n" +
          "接着好运四大吊 不糊还想双响炮" + "\n" +
          "结果对手周立波 敬礼给了 **" + "\n" +
          "启志再会伏雯晓 竟然杀出林书豪" + "\n" +
          "许嵩单张特别多 或许能凑十三幺" + "\n" +
          "输赢姑且不去说 场面倒是很热闹" + "\n" +
          "不管结果撩不撩 只图过程乐一乐"
      },
      {
        id: 4, img: "/images/5.png", title: "打麻将运气差怎么办?", text: " 打麻将运气差怎么办，打麻将是一门技术， 从理论的高度讲，它包括运筹学，逻辑学，概率论，组合排列学等，还包括后黑学等人文科学。" + "要打好麻将，需要做到以下：" + "\n" +

          "1、首先学习麻将各类规则，掌握基本技巧，手、眼结合，做到眼观六路，耳听八方。" + "\n" +

          "　　2、形成自己的擅长技术和预判能力，比如根据起牌，预判胡牌的牌型、根据其余三家的出牌情况，算计出他手上的牌型等" + "\n" +

          "　　3、参加比赛，和不同打法的选手过招，提高自己的水平。" + "\n" +

          "　　4、有好的比赛策略，因时制宜，随机应变，包括知己知彼的战术、或攻或守的方法、流局策略等。"
      },
      {
        id: 5, commend: "1", good: "1", img: "/images/2.png", title: "麻将技巧", text: " 如何碰牌——碰牌不同于吃牌，因为吃牌毕竟只有一种选择，就是说上家打什么你就吃什么，对碰牌来讲呢除你之外其余三家的牌你都可以碰，这种情况往往会有一种比较不好的后果由其是对于初学者他可能会乱碰一气。我自己打牌的时候就有这种经历在刚学牌的时候特别喜欢碰，有对子这样的话来一碰一个，感觉这样比较容易胡了"
      },
      {
        id: 6, img: "/images/1.png", title: "打麻将防骗技巧之一", text: " 在长期的麻战实战中，对于牌的路数，“老麻师”总结出不少预测的熟语，学习掌握这些熟语，有利于防骗。如，“想碰又不碰，不防一九碰”。它是根据有的地方打麻将规定，用一、九牌当将牌有番，因此，手牌中有一、九牌对子时不会去碰而总结归纳出来的猜牌路数.。"
      },


    ],

  },
  onLoad: function (o) {
    var n = this;
    var num = o.id;
    console.log(num)
    n.setData({
      message: this.data.result[num],
      type: o.type
    });
  },
  toOther: function (t) {
    console.log(t.currentTarget), wx.navigateToMiniProgram({
      appId: t.currentTarget.src,
      envVersion: "release",
      success: function (t) { }
    });
  },
  copyWeixin: function (t) {
    wx.setClipboardData({
      data: this.data.topic.weixin,
      success: function (t) {
        wx.getClipboardData({
          success: function (t) {
            console.log(t.data), wx.showToast({
              title: "已复制成功"
            });
          }
        });
      }
    });
  },
  preview: function (t) {
    console.log(t.target.dataset.src);
    var o = t.target.dataset.src;
    wx.previewImage({
      urls: [o]
    });
  },
  onReady: function () { },
  onShow: function () { },
  onHide: function () { },
  onUnload: function () { },
  onPullDownRefresh: function () { },
  onReachBottom: function () { },
  onShareAppMessage: function () { }
});